ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/app/nRF52840_app/display/page/low_touch_logging/page_low_touch_enable.c
/**
****************************************************************************
* @file     page_low_touch_enable.c
* @author   ADI
* @version  V0.1
* @date     11-Mar-2021
* @brief    This is the source file used to display low touch enable status,
            and select low touch function.
****************************************************************************
* @attention
******************************************************************************
* Copyright (c) 2021 Analog Devices, Inc.  All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
* - Redistributions of source code must retain the above copyright notice, this
*   list of conditions and the following disclaimer.
* - Redistributions in binary form must reproduce the above copyright notice,
*   this list of conditions and the following disclaimer in the documentation
*   and/or other materials provided with the distribution.
* - Modified versions of the software must be conspicuously marked as such.
* - This software is licensed solely and exclusively for use with
*   processors/products manufactured by or for Analog Devices, Inc.
* - This software may not be combined or merged with other code in any manner
*   that would cause the software to become subject to terms and conditions
*   which differ from those listed here.
* - Neither the name of Analog Devices, Inc. nor the names of its contributors
*   may be used to endorse or promote products derived from this software
*   without specific prior written permission.
* - The use of this software may or may not infringe the patent rights of one
**   or more patent holders.  This license does not release you from the
*   requirement that you obtain separate licenses from these patent holders to
*   use this software.
*
* THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES, INC. AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
* NONINFRINGEMENT, TITLE, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL ANALOG DEVICES, INC. OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, PUNITIVE OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, DAMAGES ARISING OUT OF
* CLAIMS OF INTELLECTUAL PROPERTY RIGHTS INFRINGEMENT; PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
******************************************************************************/
#ifdef ENABLE_WATCH_DISPLAY
#if defined(LOW_TOUCH_FEATURE)
#include "display_app.h"
#include "lcd_driver.h"
#include "key_detect.h"
#include "lygl.h"
#include "image_declare.h"
#include "dcb_general_block.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "low_touch_task.h"

extern volatile uint8_t gsCfgFileFoundFlag;
static uint8_t lt_app_enab_status;

static void display_low_touch_config(void)
{
    char str_enab_status[10];
    lcd_background_color_set(COLOR_BACKGROUND);
    lt_app_enab_status = get_lt_app_status();
    if(lt_app_enab_status)
      strcpy(str_enab_status,"Enabled");
    else
      strcpy(str_enab_status,"Disabled");
    lygl_dis_string_middle(&lygl_font_47,104,74,COLOR_WHITE,"LT APP");

    lygl_dis_string_middle(&lygl_font_48,104,140,COLOR_YELLOW,str_enab_status);
    lcd_display_refresh_all();
}
static void display_func(void)
{
    display_low_touch_config();
    dis_dynamic_refresh(500);
}

static void key_handle(uint8_t key_value)
{
    switch(key_value)
    {
        case KEY_SELECT_SHORT:
        {
            if(get_low_touch_trigger_mode2_status())
                dis_page_jump(&page_menu);
            else
            {

                //Turn OFF, if its already enabled
                if(lt_app_enab_status)
                  EnableLowTouchDetection(false);
                //Turn ON, if its already disabled
                else
                {
                  if (gen_blk_get_dcb_present_flag() || gsCfgFileFoundFlag)
                  {
                    EnableLowTouchDetection(true);
                  }
                  else
                  {
                    //No LT config file
                    lcd_background_color_set(COLOR_WHITE);
                    lygl_dis_string_middle(&lygl_font_48,104,140,COLOR_BLACK,"No Config");
                    lcd_display_refresh_all();
                    dis_dynamic_refresh(500);
                    MCU_HAL_Delay(4000);
                  }
                }
            }

        }
        break;
        case KEY_NAVIGATION_SHORT:
        {
            if(get_low_touch_trigger_mode2_status())
                dis_page_jump(&page_menu);
            else
                dis_page_jump(&page_low_touch_lt_app_lcfg);
        }
        break;
        case KEY_SELECT_LONG_VALUE:
        {
            if(get_low_touch_trigger_mode2_status())
                dis_page_jump(&page_menu);
            else
                dis_page_jump(&page_low_touch_logging);
        }
        break;
        default:break;
    }
}

/*used to handle signal except key,
  for example
*/
static void signal_handle(uint8_t signal_value)
{
    switch(signal_value)
    {
        case DIS_REFRESH_SIGNAL:
        {
            display_low_touch_config();
        }
        break;
        /*can add other key handle*/
        default:break;
    }
}
const PAGE_HANDLE page_low_touch_enable = {
.display_func = &display_func,
.key_handle = &key_handle,
.signal_handle = &signal_handle,
.page_type = DIS_STATIC_PAGE,
};
#endif//LOW_TOUCH_FEATURE
#endif